using McMaster.Extensions.CommandLineUtils;

namespace Gimme.Commands
{

    [Command(
        Name = "gimme",
        Description = 
        @"

         ✨    
 ██████╗ ██╗███╗   ███╗███╗   ███╗███████╗
██╔════╝ ██║████╗ ████║████╗ ████║██╔════╝
██║  ███╗██║██╔████╔██║██╔████╔██║█████╗  
██║   ██║██║██║╚██╔╝██║██║╚██╔╝██║██╔══╝  
╚██████╔╝██║██║ ╚═╝ ██║██║ ╚═╝ ██║███████╗
 ╚═════╝ ╚═╝╚═╝     ╚═╝╚═╝     ╚═╝╚══════╝

The dotnet cli tool that gives you what you want 😎

        "),
    ]
    public class GimmeCommand
    {
        public void OnExecute(CommandLineApplication app, IConsole console)
        {
            console.WriteLine("Hello from Gimme!");
        }
    }
}
